import React from 'react';
import styles from './OurExpertise.module.css'; // Import the CSS module
import { Helmet } from 'react-helmet';

import buy from "../Content/buy-home.png"
import people from "../Content/people.png"

function OurExpertise() {
    const expertises = [
        { title: 'קבוצות רכישה', description: 'היא שיטה ייחודית לרכישת נכס נדל"ן, שבה אנשים פרטיים מתאגדים יחד במטרה לרכוש קרקע ולבנות עליה פרויקט מגורים או מסחרי, תוך הימנעות מתלות ביזם. השיטה, המקובלת כבר מעל ל-30 שנה בישראל, מאפשרת לרוכשים לחסוך בעלויות הנכס – חיסכון שיכול להגיע עד 30% בזכות הימנעות מתשלום רווח יזמי, חיסכון במע"מ ובמס רכישה כפול. יתרה מכך, חברי הקבוצה נהנים משליטה רבה יותר בתהליך: הם שותפים להחלטות בנוגע לעיצוב הדירות, בחירת אנשי המקצוע וחומרי הגלם, לצד ביטחון קנייני המבטיח רישום של חלקם היחסי בקרקע כבר בשלב מוקדם. עם זאת, הצלחתה של קבוצת רכישה תלויה במידה רבה בבחירה נכונה של החברה המארגנת. חברה מנוסה ומקצועית תדאג לתהליך מסודר הכולל גיבוש הסכם שיתוף מפורט ומאוזן בין חברי הקבוצה, ליווי בנקאי לפרויקט להבטחת ניהול תקציבי שקוף, ושימוש בשירותי משרד עורכי דין מוביל עם ניסיון מוכח בתחום. מנגנון נאמנות מקצועי מבטיח שהכספים שמפקידים החברים יישארו בטוחים וייעודו בצורה שקופה בהתאם להתקדמות הפרויקט. תהליך זה מאפשר לצמצם סיכונים ולהעניק ביטחון נוסף לחברי הקבוצה. נוסף על כך, קבוצת רכישה מעניקה אפשרות להתאים את הנכס לצרכים האישיים של חבריה, כגון שינויים בתכנון הפנימי ובחירת חומרי גמר מותאמים אישית, מה שהופך אותה לאופציה אטרקטיבית גם עבור משקיעים. היא מציעה פוטנציאל רווח משמעותי, שכן ערך הנכס בסיום הבנייה לרוב עולה על עלות הרכישה והבנייה. יחד עם זאת, כמו בכל פרויקט נדל"ן, ישנם סיכונים ואתגרים: עלות סופית שאינה מובטחת מראש, עיכובים אפשריים בלוחות הזמנים ותלות בחברי הקבוצה וביכולותיהם הכלכליות. לכן, חשוב לבדוק היטב את הקריטריונים לעסקה מוצלחת, בהם הניסיון של החברה המארגנת, התכנון הכלכלי, המשפטי וההנדסי, ותהליך קבלת ההחלטות בקבוצה. שיתוף פעולה בין חברי הקבוצה, לצד ניהול מקצועי ומוקפד, יכול להפוך את קבוצת הרכישה להזדמנות מצוינת להשגת דירה או נכס מסחרי בתנאים אטרקטיביים, תוך שילוב של חיסכון, מעורבות והשבחת הנכס.', icon: buy },
        { title: 'קבוצות רוכשים', description: 'קבוצת רוכשים היא קבוצה של אנשים פרטיים שמתאגדים יחד במטרה לרכוש דירות בפרויקט בנייה מקבלן או יזם, בדרך כלל באזורי מגורים מבוקשים. מטרת הקבוצה היא לנצל את כוח הקנייה המרוכז על מנת לקבל הנחות משמעותיות ממחיר הדירה וכן הטבות במפרט הטכני של הדירה. רכישת הדירות מתבצעת ישירות מהקבלן תוך שמירה על זכויות הרוכשים על פי חוק המכר. יתרונות קבוצת רוכשים: הסיכון בקבוצת רוכשים נמוך יחסית, מכיוון שהרוכשים מקבלים ערבות חוק מכר, שמבטיחה את זכויותיהם. זאת בניגוד לרכישת דירה בקבוצת רכישה, שבה לא תמיד יש את הבטחונות החוקיים של חוק המכר. באופן כללי, קבוצת רוכשים מספקת לרוכשים יתרונות פיננסיים כמו חסכון משמעותי בעלויות, שכן הם יכולים לקבל הנחה של עד 12% ממחיר השיווק. לרוכשי דירות בקבוצת רוכשים יש את היתרון של רכישה במחיר סופי ומובטח מראש, על כל רכיבי המפרט, ללא חשש מעלויות נוספות שיכולות להתגלות במהלך ביצוע הבנייה. יתרון נוסף הוא משך הזמן הקצר יחסית למסירת הדירה, שכן לעיתים מדובר בפרויקטים של דירות שנמצאות בשלבים מתקדמים יותר של הבנייה או אפילו דירות קיימות שנמכרות ישירות מהקבלן. בנוגע לתהליך המימון, תשלום עבור הדירה בקבוצת רוכשים מתבצע על פי פריסת תשלומים שהולמת את התקדמות הבנייה, כך שלא נדרשים הרוכשים לשלם את מלא התמורה בשלב מוקדם כמו בקבוצת רכישה. תהליך זה מקטין את העומס הפיננסי על הרוכשים. איך לבחור קבוצת רוכשים מוצלחת? בכדי להבטיח את הצלחת העסקה בקבוצת רוכשים, יש לוודא כי החברה המארגנת את הקבוצה היא בעלת ניסיון בתחום הנדל"ן ובעלת קשרים עם קבלנים ויזמים מהימנים. בנוסף, חשוב לבדוק את מימון הפרויקט – האם יש בנק מלווה, והאם יש סנכרון בין המימון לבין הבנייה בפועל. לרוכשי הדירות בקבוצת רוכשים יש את היתרון של ערבות חוק מכר, כך שאין צורך בהגנה משפטית נוספת מצד משרד עו"ד. עם זאת, יש להקפיד כי החוזים וההסכמים שנחתמים בין חברי הקבוצה לבין הקבלן יהיו ברורים ומובילים, וכוללים תנאים שיבטיחו את ביצוע הפרויקט בצורה מקצועית ובזמן. סיכום: קבוצת רוכשים היא שיטה מצוינת עבור מי שמחפש לרכוש דירה במחיר נמוך יותר ממה שמוצע בשוק, עם שליטה על פרטי העסקה, בטחונות חוקיים, והגנה פיננסית. כאשר מדובר בקבוצת רוכשים מנוסה, שנבחרו בה אנשי מקצוע מיומנים, ההזדמנות לרכוש נכס במחיר מוזל תוך שמירה על זכויות הרוכשים היא גדולה ומספקת שקט נפשי במהלך כל תהליך הרכישה.', icon: people },

    ];

    return (
        <div className={styles.container}>
                <Helmet>
                <title>Our Expertise - Lahav Group | Real Estate Specialists</title>
                <meta name="description" content="Discover the areas of expertise at Lahav Group. As leading real estate specialists in Israel, we excel in organizing purchasing groups, managing large-scale projects, and delivering exceptional value to our clients." />
                </Helmet>

            <h1>Our Expertise</h1>
            <h2>תחומי עיסוק</h2>
            <div className={styles.HR1}/>
            <div className={styles.expertiseList}>
                {expertises.map(expertise => (
                    <div key={expertise.title} className={styles.expertise}>
                        <div>
                            <h3>{expertise.title}</h3>
                            <hr className={styles.hr}/>
                            <p>{expertise.description}</p>
                        </div>
                        <img src={expertise.icon} alt="icon" className={styles.icon} />
                    </div>
                ))}
            </div>
        </div>
    );
}

export default OurExpertise;
